In [1]:
from pandas import DataFrame
from pandas import concat

In [2]:
df1=DataFrame({'이름':['영희','철수'],'국어':[87,91]})
df1

   이름  국어
0  영희  87
1  철수  91

In [3]:
df2=DataFrame({'이름':['민철','수현'],'국어':[78,92]})
df2

   이름  국어
0  민철  78
1  수현  92

In [5]:
concat([df1,df2])

   이름  국어
0  영희  87
1  철수  91
0  민철  78
1  수현  92

In [6]:
인덱스_재구성df=concat([df1,df2])
인덱스_재구성df.reset_index(inplace=True, drop=True)
인덱스_재구성df

   이름  국어
0  영희  87
1  철수  91
2  민철  78
3  수현  92

In [7]:
concat([df1,df2],ignore_index=True)

   이름  국어
0  영희  87
1  철수  91
2  민철  78
3  수현  92

In [8]:
df3=DataFrame({'이름':['영희','철수'],'국어':[87,91]})
df3

   이름  국어
0  영희  87
1  철수  91

In [11]:
df4=DataFrame({'이름':['민철','수현'],'수학':[78,92]})
df4

   이름  수학
0  민철  78
1  수현  92

In [12]:
concat([df3,df4],ignore_index=True)

   이름    국어    수학
0  영희  87.0   NaN
1  철수  91.0   NaN
2  민철   NaN  78.0
3  수현   NaN  92.0

In [13]:
df5=DataFrame({'국어':[87,91,85]},index=['영희','철수','민수'])
df5

    국어
영희  87
철수  91
민수  85

In [15]:
df6=DataFrame({'국어':[78,92,82]},index=['민철','수현','민수'])
df6

    국어
민철  78
수현  92
민수  82

In [16]:
concat([df5,df6])

    국어
영희  87
철수  91
민수  85
민철  78
수현  92
민수  82

In [17]:
concat([df5,df6],ignore_index=True)

   국어
0  87
1  91
2  85
3  78
4  92
5  82